app/Services/ConciergeBanService.php

        $actorLabel = $actor?->name ?: 'WebAdmin';
        $expiresAt = $this->resolveExpiresAt($hotel, $conversation, $durationKey);

        $ban = HotelConciergeBan::create([
            'hotel_id' => $hotel->id,
            'guest_external_id' => $guestExternalId,
            'guest_display_name' => $conversation->guest_display_name,
            'room_number' => $conversation->room_number,
            'duration_key' => $durationKey,
            'reason' => $reason,
            'banned_at' => now(),
            'expires_at' => $expiresAt,
            'banned_by_user_id' => $actor?->id,
            'banned_by_label' => $actorLabel,
            'conversation_id' => $conversation->id,
            'chat_snapshot' => $snapshot,
            'created_at' => now(),
        ]);
---
insert into "hotel_concierge_bans" ("hotel_id", "guest_external_id", "guest_display_name", "room_number", "duration_key", "reason", "banned_at", "expires_at", "banned_by_user_id", "banned_by_label", "conversation_id", "chat_snapshot", "created_at", "id") values ('d5f11bcf-7a0d-42ac-a04b-44d0add733d6', 'demo-a1001-vetiska', 'Michal Vetiška', '101', '30m', 'ses kokot proste', '2026-08-25 03:28:05', '2026-08-25 03:58:05', 1, 'Super Admin', 'f69cb65e-5fd4-407d-b4a1-729ebeeb725c', '[{"sender_type":"system","text":"A reception staff member has taken over this chat and will reply to you shortly.","created_at":"2026-08-25T02:55:34+00:00"},{"sender_type":"guest","text":"cauec","created_at":"2026-08-25T03:11:52+00:00"}]', '2026-08-25 03:28:05', 'b6551b2b-251b-4465-a41a-38b18b8f02df')

        $guestNotice = $this->guestBanNotice($locale, $reason);
        $staffNotice = "Host zabanován ({$durationLabel}) uživatelem {$actorLabel}. Důvod: {$reason}";

        HotelConciergeMessage::create([
            'conversation_id' => $conversation->id,
            'sender_type' => 'system',
            'body' => $guestNotice,
            'body_original' => $guestNotice,
            'body_translated' => $guestNotice,
            'locale' => $locale,
            'staff_display_name' => ConciergeBotService::GUEST_ONLY_NOTICE_MARKER,
            'created_at' => now(),
        ]);
---
insert into "hotel_concierge_messages" ("conversation_id", "sender_type", "body", "body_original", "body_translated", "locale", "staff_display_name", "created_at", "id") values ('f69cb65e-5fd4-407d-b4a1-729ebeeb725c', 'system', 'Host zabanován (30 minut) uživatelem Super Admin. Důvod: ses kokot proste', 'Host zabanován (30 minut) uživatelem Super Admin. Důvod: ses kokot proste', null, 'cs', '__staff_only__', '2026-08-25 03:28:05', '7878c627-11cb-48c4-b405-51bc89c1a6cf')

    private function lift(
        Hotel $hotel,
        HotelConciergeBan $ban,
        ?HotelConciergeConversation $conversation,
        ?User $actor,
    ): HotelConciergeBan {
        $actorLabel = $actor?->name ?: 'WebAdmin';

        $ban->update([
            'lifted_at' => now(),
            'lifted_by_user_id' => $actor?->id,
            'lifted_by_label' => $actorLabel,
        ]);

        if ($conversation) {
            $locale = $conversation->guest_locale ?: 'cs';
            $guestNotice = $this->guestUnbanNotice($locale);
            $staffNotice = "Ban zrušen uživatelem {$actorLabel}.";

            HotelConciergeMessage::create([
                'conversation_id' => $conversation->id,
                'sender_type' => 'system',
                'body' => $guestNotice,
                'body_original' => $guestNotice,
                'body_translated' => $guestNotice,
                'locale' => $locale,
                'staff_display_name' => ConciergeBotService::GUEST_ONLY_NOTICE_MARKER,
                'created_at' => now(),
            ]);

            HotelConciergeMessage::create([
                'conversation_id' => $conversation->id,
                'sender_type' => 'system',
                'body' => $staffNotice,
                'body_original' => $staffNotice,
                'body_translated' => null,
                'locale' => 'cs',
                'staff_display_name' => ConciergeBotService::STAFF_ONLY_NOTICE_MARKER,
                'created_at' => now(),
            ]);
---
insert into "hotel_concierge_messages" ("conversation_id", "sender_type", "body", "body_original", "body_translated", "locale", "staff_display_name", "created_at", "id") values ('f69cb65e-5fd4-407d-b4a1-729ebeeb725c', 'system', 'Chat access has been restored. You can write to us again.', 'Chat access has been restored. You can write to us again.', 'Chat access has been restored. You can write to us again.', 'en', '__guest_only__', '2026-08-25 03:31:58', 'b3706c1c-e3ae-4a10-b648-574042a3f813')
insert into "hotel_concierge_messages" ("conversation_id", "sender_type", "body", "body_original", "body_translated", "locale", "staff_display_name", "created_at", "id") values ('f69cb65e-5fd4-407d-b4a1-729ebeeb725c', 'system', 'Ban zrušen uživatelem Super Admin.', 'Ban zrušen uživatelem Super Admin.', null, 'cs', '__staff_only__', '2026-08-25 03:31:58', '1b39171c-db36-43f9-837b-0d4d714b264b')

    private function logCrm(Hotel $hotel, HotelConciergeConversation $conversation, string $staffName, string $summary): void
    {
        try {
            $guestKey = $this->guestOpsService->guestKeyForConversation($conversation);

            HotelCrmInteraction::create([
                'hotel_id' => $hotel->id,
                'guest_key' => $guestKey,
                'channel' => 'note',
                'direction' => 'internal',
                'subject' => 'Concierge ban',
                'body' => $summary,
                'staff_name' => $staffName,
                'created_at' => now(),
            ]);
---
insert into "hotel_crm_interactions" ("hotel_id", "guest_key", "channel", "direction", "subject", "body", "staff_name", "created_at", "id") values ('d5f11bcf-7a0d-42ac-a04b-44d0add733d6', 'ext:demo-a1001-vetiska', 'note', 'internal', 'Concierge ban', 'Ban Concierge zrušen', 'Super Admin', '2026-08-25 03:31:58', 'ec3a0995-9738-4831-8865-704b776c6243')