app/Services/ConciergeBotService.php

                'unread_staff_count' => max(1, (int) $conversation->unread_staff_count),
            ]);

            HotelConciergeMessage::create([
                'conversation_id' => $conversation->id,
                'sender_type' => 'system',
                'body' => $staffNoticeCs,
                'body_original' => $staffNoticeCs,
                'body_translated' => $guestNotice,
                'locale' => 'cs',
                'staff_display_name' => null,
                'created_at' => now(),
            ]);
---
insert into "hotel_concierge_messages" ("conversation_id", "sender_type", "body", "body_original", "body_translated", "locale", "staff_display_name", "created_at", "id") values ('055093fc-ceb3-4fb4-aa2b-d3ac42a827db', 'system', 'Host chce živou recepci — čeká na převzetí chatu.', 'Host chce živou recepci — čeká na převzetí chatu.', 'Přepojuji vás na živou recepci. Chvilku strpení — člen obsluhy se brzy připojí do chatu.', 'cs', null, '2026-08-25 02:03:16', 'bceb6ea4-c4e7-4ab1-affb-fb405b635838')