app/Services/CrmService.php

select count(*) as aggregate from "hotel_crm_promotions" where "hotel_id" = 'd5f11bcf-7a0d-42ac-a04b-44d0add733d6' and "status" in ('active', 'scheduled')
---
    public function overview(Hotel $hotel): array
    {
        $guests = $this->buildGuestList($hotel);
        $alerts = $this->alerts($hotel);
        $promotions = HotelCrmPromotion::query()
            ->where('hotel_id', $hotel->id)
            ->whereIn('status', ['active', 'scheduled'])
            ->count();

select "check_in_at", "check_out_at" from "hotel_crm_guest_profiles" where "hotel_id" = 'd5f11bcf-7a0d-42ac-a04b-44d0add733d6'
---
    public function stayMetrics(Hotel $hotel): array
    {
        $tz = config('app.timezone', 'Europe/Prague');
        $today = \Carbon\Carbon::now($tz)->startOfDay();
        $yesterdayEnd = $today->copy()->subDay()->endOfDay();

        $inHouse = 0;
        $arrivalsToday = 0;
        $departuresToday = 0;
        $inHouseYesterday = 0;
        $dataSource = 'none';

        try {
            $profiles = HotelCrmGuestProfile::query()
                ->where('hotel_id', $hotel->id)
                ->get(['check_in_at', 'check_out_at']);

select count(distinct "room_number") as aggregate from "hotel_service_requests" where "hotel_id" = 'd5f11bcf-7a0d-42ac-a04b-44d0add733d6' and "status" in ('new', 'pending', 'in_progress') and "room_number" is not null and "room_number" != ''
---
        }

        if ($inHouse === 0 && ModuleService::isEnabled('activity')) {
            $inHouse = (int) HotelServiceRequest::query()
                ->where('hotel_id', $hotel->id)
                ->whereIn('status', self::OPEN_STATUSES)
                ->whereNotNull('room_number')
                ->where('room_number', '!=', '')
                ->distinct()
                ->count('room_number');

select * from "hotel_crm_alerts" where "hotel_id" = 'd5f11bcf-7a0d-42ac-a04b-44d0add733d6' order by case severity when 'critical' then 0 when 'warning' then 1 else 2 end, "created_at" desc
---
    public function alerts(Hotel $hotel): array
    {
        $this->syncSystemAlerts($hotel);

        return HotelCrmAlert::query()
            ->where('hotel_id', $hotel->id)
            ->orderByRaw("case severity when 'critical' then 0 when 'warning' then 1 else 2 end")
            ->orderByDesc('created_at')
            ->get()
            ->map(fn (HotelCrmAlert $a) => $this->alertPayload($a))
            ->values()
            ->all();

select * from "hotel_crm_guest_profiles" where "hotel_id" = 'd5f11bcf-7a0d-42ac-a04b-44d0add733d6'
select * from "hotel_service_requests" where "hotel_id" = 'd5f11bcf-7a0d-42ac-a04b-44d0add733d6'
select * from "hotel_concierge_conversations" where "hotel_id" = 'd5f11bcf-7a0d-42ac-a04b-44d0add733d6'
---
    private function buildGuestList(Hotel $hotel): Collection
    {
        $map = [];
        $profiles = HotelCrmGuestProfile::query()
            ->where('hotel_id', $hotel->id)
            ->get()
            ->keyBy('guest_key');

        if (ModuleService::isEnabled('activity')) {
            foreach (HotelServiceRequest::query()->where('hotel_id', $hotel->id)->get() as $request) {
                $this->mergeGuestFromRequest($map, $request);
            }
        }

        if (ModuleService::isEnabled('concierge')) {
            foreach (HotelConciergeConversation::query()->where('hotel_id', $hotel->id)->get() as $conv) {

update "hotel_crm_alerts" set "status" = 'resolved', "resolved_at" = '2026-08-25 02:21:54', "updated_at" = '2026-08-25 02:21:54' where "hotel_id" = 'd5f11bcf-7a0d-42ac-a04b-44d0add733d6' and "alert_type" in ('open_request', 'unread_chat') and "status" = 'active'
select * from "hotel_service_requests" where "hotel_id" = 'd5f11bcf-7a0d-42ac-a04b-44d0add733d6' and "status" in ('new', 'pending', 'in_progress') order by "created_at" desc
select exists(select * from "hotel_crm_alerts" where "hotel_id" = 'd5f11bcf-7a0d-42ac-a04b-44d0add733d6' and "source_module" = 'activity' and "source_id" = '0c99497a-ad0a-4fd5-ad24-a7f7f4dc0b3f' and "status" = 'active') as "exists"
insert into "hotel_crm_alerts" ("hotel_id", "guest_key", "alert_type", "severity", "title", "body", "status", "source_module", "source_id", "id", "updated_at", "created_at") values ('d5f11bcf-7a0d-42ac-a04b-44d0add733d6', 'ext:demo-a1001-vetiska', 'open_request', 'warning', 'Otevřený požadavek · Room service', 'Michal Vetiška · pokoj 101', 'active', 'activity', '0c99497a-ad0a-4fd5-ad24-a7f7f4dc0b3f', 'eef84b89-ad97-4033-bcfa-176c24b892b2', '2026-08-25 02:21:54', '2026-08-25 02:21:54')
---
    private function syncSystemAlerts(Hotel $hotel): void
    {
        HotelCrmAlert::query()
            ->where('hotel_id', $hotel->id)
            ->whereIn('alert_type', ['open_request', 'unread_chat'])
            ->where('status', 'active')
            ->update(['status' => 'resolved', 'resolved_at' => now()]);

        if (ModuleService::isEnabled('activity')) {
            $open = HotelServiceRequest::query()
                ->where('hotel_id', $hotel->id)
                ->whereIn('status', self::OPEN_STATUSES)
                ->orderByDesc('created_at')
                ->get();

            foreach ($open->take(20) as $request) {
                $key = $this->guestKey($request->guest_external_id, $request->room_number, $request->guest_display_name);
                $exists = HotelCrmAlert::query()
                    ->where('hotel_id', $hotel->id)
                    ->where('source_module', 'activity')
                    ->where('source_id', $request->id)
                    ->where('status', 'active')
                    ->exists();

                if ($exists) {
                    continue;
                }

                HotelCrmAlert::create([
                    'hotel_id' => $hotel->id,
                    'guest_key' => $key,
                    'alert_type' => 'open_request',
                    'severity' => $request->priority >= 2 ? 'critical' : 'warning',
                    'title' => 'Otevřený požadavek · '.$request->service_label,
                    'body' => $request->guest_display_name.' · pokoj '.$request->room_number,
                    'status' => 'active',
                    'source_module' => 'activity',
                    'source_id' => $request->id,
                ]);

select * from "hotel_concierge_conversations" where "hotel_id" = 'd5f11bcf-7a0d-42ac-a04b-44d0add733d6' and ("metadata"->>'mode' = 'staff' or "metadata"->>'mode' = 'waiting') and "unread_staff_count" > 0
---
        }

        if (ModuleService::isEnabled('concierge')) {
            $unread = HotelConciergeConversation::query()
                ->where('hotel_id', $hotel->id)
                ->where(function ($q) {
                    $q->where('metadata->mode', 'staff')
                        ->orWhere('metadata->mode', 'waiting');
                })
                ->where('unread_staff_count', '>', 0)
                ->get();

select count(*) as aggregate from "hotel_service_requests" where "hotel_id" = 'd5f11bcf-7a0d-42ac-a04b-44d0add733d6' and "status" in ('new', 'pending', 'in_progress')
---
    private function openRequestCount(Hotel $hotel): int
    {
        if (! ModuleService::isEnabled('activity')) {
            return 0;
        }

        return HotelServiceRequest::query()
            ->where('hotel_id', $hotel->id)
            ->whereIn('status', self::OPEN_STATUSES)
            ->count();

select sum("unread_staff_count") as aggregate from "hotel_concierge_conversations" where "hotel_id" = 'd5f11bcf-7a0d-42ac-a04b-44d0add733d6' and ("metadata"->>'mode' = 'staff' or "metadata"->>'mode' = 'waiting')
---
    private function unreadChatCount(Hotel $hotel): int
    {
        if (! ModuleService::isEnabled('concierge')) {
            return 0;
        }

        return (int) HotelConciergeConversation::query()
            ->where('hotel_id', $hotel->id)
            ->where(function ($q) {
                $q->where('metadata->mode', 'staff')
                    ->orWhere('metadata->mode', 'waiting');
            })
            ->sum('unread_staff_count');

select count(*) as aggregate from "hotel_crm_tasks" where "hotel_id" = 'd5f11bcf-7a0d-42ac-a04b-44d0add733d6' and "status" = 'open'
---
    private function openTaskCount(Hotel $hotel): int
    {
        return HotelCrmTask::query()
            ->where('hotel_id', $hotel->id)
            ->where('status', 'open')
            ->count();

select count(*) as aggregate from "hotel_crm_interactions" where "hotel_id" = 'd5f11bcf-7a0d-42ac-a04b-44d0add733d6' and "created_at" >= '2026-08-18 02:21:54'
---
    private function recentInteractionCount(Hotel $hotel, int $days): int
    {
        return HotelCrmInteraction::query()
            ->where('hotel_id', $hotel->id)
            ->where('created_at', '>=', now()->subDays($days))
            ->count();