app/Services/DashboardService.php

    private function loadLayoutWidgets(Hotel $hotel): array
    {
        try {
            $row = \App\Models\HotelDashboardLayout::query()->find($hotel->id);
---
select * from "hotel_dashboard_layout" where "hotel_dashboard_layout"."hotel_id" = 'd5f11bcf-7a0d-42ac-a04b-44d0add733d6' limit 1

    private function layoutUpdatedAt(Hotel $hotel): ?string
    {
        try {
            return \App\Models\HotelDashboardLayout::query()
                ->find($hotel->id)
                ?->updated_at
                ?->toIso8601String();
---
select * from "hotel_dashboard_layout" where "hotel_dashboard_layout"."hotel_id" = 'd5f11bcf-7a0d-42ac-a04b-44d0add733d6' limit 1

    private function highlights(Hotel $hotel): array
    {
        $items = [];

        if (ModuleService::isEnabled('activity')) {
            try {
                $open = HotelServiceRequest::query()
                    ->where('hotel_id', $hotel->id)
                    ->whereIn('status', ['new', 'pending', 'in_progress'])
                    ->count();
                if ($open > 0) {
                    $items[] = [
                        'label' => 'Otevřené požadavky',
                        'value' => $open,
                        'hint' => 'Activity',
                    ];
                }
            } catch (\Throwable) {
                // ignore
            }
        }

        if (ModuleService::isEnabled('concierge')) {
            try {
                $unread = (int) \App\Models\HotelConciergeConversation::query()
                    ->where('hotel_id', $hotel->id)
                    ->where(function ($q) {
                        $q->where('metadata->mode', 'staff')
                            ->orWhere('metadata->mode', 'waiting');
                    })
                    ->sum('unread_staff_count');
---
select count(*) as aggregate from "hotel_service_requests" where "hotel_id" = 'd5f11bcf-7a0d-42ac-a04b-44d0add733d6' and "status" in ('new', 'pending', 'in_progress')
select sum("unread_staff_count") as aggregate from "hotel_concierge_conversations" where "hotel_id" = 'd5f11bcf-7a0d-42ac-a04b-44d0add733d6' and ("metadata"->>'mode' = 'staff' or "metadata"->>'mode' = 'waiting')