app/Services/NotificationService.php

select * from "hotel_admin_notification_settings" where "hotel_admin_notification_settings"."hotel_id" = 'd5f11bcf-7a0d-42ac-a04b-44d0add733d6' limit 1
---
    public function settings(Hotel $hotel): array
    {
        $row = HotelAdminNotificationSetting::query()->find($hotel->id);

select * from "hotel_admin_notifications" where "hotel_id" = 'd5f11bcf-7a0d-42ac-a04b-44d0add733d6' order by "created_at" desc limit 30
select count(*) as aggregate from "hotel_admin_notifications" where "hotel_id" = 'd5f11bcf-7a0d-42ac-a04b-44d0add733d6' and "read_at" is null
---
    public function summary(Hotel $hotel, bool $withSync = false): array
    {
        if ($withSync) {
            $this->syncIfStale($hotel);
        }

        $prefs = $this->loadPreferences($hotel);
        $badges = $this->badges($hotel, $prefs);

        $notifications = HotelAdminNotification::query()
            ->where('hotel_id', $hotel->id)
            ->orderByDesc('created_at')
            ->take(30)
            ->get()
            ->map(fn (HotelAdminNotification $n) => $this->notificationPayload($n))
            ->values()
            ->all();

        $unreadCount = HotelAdminNotification::query()
            ->where('hotel_id', $hotel->id)
            ->whereNull('read_at')
            ->count();

select * from "hotel_admin_notification_settings" where "hotel_admin_notification_settings"."hotel_id" = 'd5f11bcf-7a0d-42ac-a04b-44d0add733d6' limit 1
---
    private function loadPreferences(Hotel $hotel): array
    {
        $row = HotelAdminNotificationSetting::query()->find($hotel->id);

select count(*) as aggregate from "hotel_service_requests" where "hotel_id" = 'd5f11bcf-7a0d-42ac-a04b-44d0add733d6' and "status" in ('new', 'pending', 'in_progress')
select sum("unread_staff_count") as aggregate from "hotel_concierge_conversations" where "hotel_id" = 'd5f11bcf-7a0d-42ac-a04b-44d0add733d6' and "status" != 'archived' and ("metadata"->>'mode' = 'staff' or "metadata"->>'mode' = 'waiting')
select count(*) as aggregate from "hotel_concierge_conversations" where "hotel_id" = 'd5f11bcf-7a0d-42ac-a04b-44d0add733d6' and "status" = 'open' and ("metadata"->>'mode' is null or "metadata"->>'mode' = 'bot' or "metadata"->>'mode' = '')
select count(*) as aggregate from "hotel_concierge_conversations" where "hotel_id" = 'd5f11bcf-7a0d-42ac-a04b-44d0add733d6' and "status" != 'archived' and "metadata"->>'mode' = 'waiting' and "unread_staff_count" = 0
---
    private function badges(Hotel $hotel, array $prefs): array
    {
        $activity = 0;
        $concierge = 0;

        if ($prefs['activity_enabled'] && ModuleService::isEnabled('activity')) {
            $statuses = $prefs['activity_statuses'] ?: ['new'];
            $activity = HotelServiceRequest::query()
                ->where('hotel_id', $hotel->id)
                ->whereIn('status', $statuses)
                ->count();
        }

        if ($prefs['concierge_enabled'] && ModuleService::isEnabled('concierge')) {
            $unread = (int) HotelConciergeConversation::query()
                ->where('hotel_id', $hotel->id)
                ->where('status', '!=', 'archived')
                ->where(function ($q) {
                    $q->where('metadata->mode', 'staff')
                        ->orWhere('metadata->mode', 'waiting');
                })
                ->sum('unread_staff_count');

            $botChats = (int) HotelConciergeConversation::query()
                ->where('hotel_id', $hotel->id)
                ->where('status', 'open')
                ->hasGuestMessages()
                ->where(function ($q) {
                    $q->whereNull('metadata->mode')
                        ->orWhere('metadata->mode', 'bot')
                        ->orWhere('metadata->mode', '');
                })
                ->count();

            $waitingZeroUnread = (int) HotelConciergeConversation::query()
                ->where('hotel_id', $hotel->id)
                ->where('status', 'open')
                ->hasGuestMessages()
                ->where('metadata->mode', 'waiting')
                ->where('unread_staff_count', 0)
                ->count();

select "id", "service_label", "guest_display_name", "room_number", "status", "updated_at" from "hotel_service_requests" where "hotel_id" = 'd5f11bcf-7a0d-42ac-a04b-44d0add733d6' and "status" in ('new', 'pending', 'in_progress') order by "updated_at" desc, "created_at" desc limit 40
---
    private function syncActivityNotifications(Hotel $hotel, array $prefs): void
    {
        if (! $prefs['activity_enabled'] || ! ModuleService::isEnabled('activity')) {
            return;
        }

        $statuses = $prefs['activity_statuses'] ?: ['new'];

        $requests = HotelServiceRequest::query()
            ->where('hotel_id', $hotel->id)
            ->whereIn('status', $statuses)
            ->orderByDesc('updated_at')
            ->orderByDesc('created_at')
            ->take(40)
            ->get(['id', 'service_label', 'guest_display_name', 'room_number', 'status', 'updated_at']);

select "id", "guest_display_name", "room_number", "unread_staff_count", "metadata" from "hotel_concierge_conversations" where "hotel_id" = 'd5f11bcf-7a0d-42ac-a04b-44d0add733d6' and "status" != 'archived' and (("metadata"->>'mode' = 'waiting' or ("metadata"->>'mode' = 'staff' and "unread_staff_count" > 0)) or ("status" = 'open' and ("metadata"->>'mode' is null or "metadata"->>'mode' = 'bot' or "metadata"->>'mode' = ''))) order by "last_message_at" desc limit 40
---
    private function syncConciergeNotifications(Hotel $hotel, array $prefs): void
    {
        if (! $prefs['concierge_enabled'] || ! ModuleService::isEnabled('concierge')) {
            return;
        }

        $conversations = HotelConciergeConversation::query()
            ->where('hotel_id', $hotel->id)
            ->where('status', '!=', 'archived')
            ->hasGuestMessages()
            ->where(function ($q) {
                $q->where(function ($attention) {
                    $attention->where('metadata->mode', 'waiting')
                        ->orWhere(function ($staff) {
                            $staff->where('metadata->mode', 'staff')
                                ->where('unread_staff_count', '>', 0);
                        });
                })->orWhere(function ($bot) {
                    $bot->where('status', 'open')
                        ->where(function ($modes) {
                            $modes->whereNull('metadata->mode')
                                ->orWhere('metadata->mode', 'bot')
                                ->orWhere('metadata->mode', '');
                        });
                });
            })
            ->orderByDesc('last_message_at')
            ->take(40)
            ->get(['id', 'guest_display_name', 'room_number', 'unread_staff_count', 'metadata']);

insert into "hotel_admin_notifications" ("hotel_id", "source", "source_id", "title", "body", "link_path", "created_at", "id") values ('d5f11bcf-7a0d-42ac-a04b-44d0add733d6', 'concierge', 'f69cb65e-5fd4-407d-b4a1-729ebeeb725c', 'Chat s AI · Michal Vetiška', 'Pokoj 101 · Host řeší s chatbotem', '/concierge', '2026-08-25 02:39:15', '43f03ced-06d1-4e01-bbd6-1f1ead998886')
---
                continue;
            }

            HotelAdminNotification::create([
                'hotel_id' => $hotel->id,
                'source' => 'concierge',
                'source_id' => $conv->id,
                'title' => $title,
                'body' => $body,
                'link_path' => '/concierge',
                'created_at' => now(),
            ]);

select "id" from "hotel_service_requests" where "hotel_id" = 'd5f11bcf-7a0d-42ac-a04b-44d0add733d6' and "status" in ('new', 'pending', 'in_progress')
delete from "hotel_admin_notifications" where "hotel_id" = 'd5f11bcf-7a0d-42ac-a04b-44d0add733d6' and "source" = 'activity' and "source_id" not in ('0c99497a-ad0a-4fd5-ad24-a7f7f4dc0b3f', 'ca9d9719-5528-482c-a6a0-37f507c88200')
select "id" from "hotel_concierge_conversations" where "hotel_id" = 'd5f11bcf-7a0d-42ac-a04b-44d0add733d6' and "status" != 'archived' and ("metadata"->>'mode' = 'waiting' or ("metadata"->>'mode' = 'staff' and "unread_staff_count" > 0) or ("status" = 'open' and ("metadata"->>'mode' is null or "metadata"->>'mode' = 'bot' or "metadata"->>'mode' = '')))
delete from "hotel_admin_notifications" where "hotel_id" = 'd5f11bcf-7a0d-42ac-a04b-44d0add733d6' and "source" = 'concierge' and "source_id" not in ('181d9c3f-6d72-4a07-b446-57119790889c', 'c1350ffe-c001-4025-b982-00d20799391a', '8eaaae49-4348-433f-9c1b-4df99a10d0a5')
---
    private function pruneStaleNotifications(Hotel $hotel, array $prefs): void
    {
        if ($prefs['activity_enabled'] && ModuleService::isEnabled('activity')) {
            $statuses = $prefs['activity_statuses'] ?: ['new'];
            $activeIds = HotelServiceRequest::query()
                ->where('hotel_id', $hotel->id)
                ->whereIn('status', $statuses)
                ->pluck('id');

            HotelAdminNotification::query()
                ->where('hotel_id', $hotel->id)
                ->where('source', 'activity')
                ->whereNotIn('source_id', $activeIds)
                ->delete();
        } else {
            HotelAdminNotification::query()
                ->where('hotel_id', $hotel->id)
                ->where('source', 'activity')
                ->delete();
        }

        if ($prefs['concierge_enabled'] && ModuleService::isEnabled('concierge')) {
            $activeIds = HotelConciergeConversation::query()
                ->where('hotel_id', $hotel->id)
                ->where('status', '!=', 'archived')
                ->hasGuestMessages()
                ->where(function ($q) {
                    $q->where('metadata->mode', 'waiting')
                        ->orWhere(function ($staff) {
                            $staff->where('metadata->mode', 'staff')
                                ->where('unread_staff_count', '>', 0);
                        })
                        ->orWhere(function ($bot) {
                            $bot->where('status', 'open')
                                ->where(function ($modes) {
                                    $modes->whereNull('metadata->mode')
                                        ->orWhere('metadata->mode', 'bot')
                                        ->orWhere('metadata->mode', '');
                                });
                        });
                })
                ->pluck('id');

            HotelAdminNotification::query()
                ->where('hotel_id', $hotel->id)
                ->where('source', 'concierge')
                ->whereNotIn('source_id', $activeIds)
                ->delete();

select * from "hotels" where "hotels"."id" = 'd5f11bcf-7a0d-42ac-a04b-44d0add733d6' limit 1
select * from "hotel_admin_notifications" where "hotel_id" = 'd5f11bcf-7a0d-42ac-a04b-44d0add733d6' and "source" = 'concierge' and "source_id" = '055093fc-ceb3-4fb4-aa2b-d3ac42a827db' limit 1
---
    public function upsertConciergeAdminNotice(HotelConciergeConversation $conversation, string $kind): void
    {
        $hotel = Hotel::query()->find($conversation->hotel_id);
        if (! $hotel || ! ModuleService::isEnabled('concierge')) {
            return;
        }

        $prefs = $this->settings($hotel)['preferences'];
        if (! ($prefs['concierge_enabled'] ?? true)) {
            return;
        }

        [$title, $body] = match ($kind) {
            'bot_started' => [
                'Chat s AI · '.$conversation->guest_display_name,
                ($conversation->room_number ? 'Pokoj '.$conversation->room_number.' · ' : '')
                    .'Host začal řešení s chatbotem',
            ],
            'waiting' => [
                'Žádá člověka · '.$conversation->guest_display_name,
                ($conversation->room_number ? 'Pokoj '.$conversation->room_number.' · ' : '')
                    .'Host chce živou recepci',
            ],
            default => [
                'Nová zpráva · '.$conversation->guest_display_name,
                ($conversation->room_number ? 'Pokoj '.$conversation->room_number.' · ' : '')
                    .'Nepřečtená zpráva v Concierge',
            ],
        };

        $existing = HotelAdminNotification::query()
            ->where('hotel_id', $hotel->id)
            ->where('source', 'concierge')
            ->where('source_id', $conversation->id)
            ->first();

insert into "hotel_admin_notifications" ("hotel_id", "source", "source_id", "title", "body", "link_path", "created_at", "id") values ('d5f11bcf-7a0d-42ac-a04b-44d0add733d6', 'concierge', '055093fc-ceb3-4fb4-aa2b-d3ac42a827db', 'Žádá člověka · Vetiška', 'Pokoj A1001 · Host chce živou recepci', '/concierge', '2026-08-25 02:03:16', 'a3625634-560f-4bf5-92ac-cd2fe288218c')
---
            return;
        }

        HotelAdminNotification::create([
            'hotel_id' => $hotel->id,
            'source' => 'concierge',
            'source_id' => $conversation->id,
            'title' => $title,
            'body' => $body,
            'link_path' => '/concierge',
            'created_at' => now(),
        ]);