app/Services/NotificationService.php

select * from "hotel_admin_notifications" where "hotel_id" = 'd5f11bcf-7a0d-42ac-a04b-44d0add733d6' and "source" = 'activity' and "source_id" in ('0c99497a-ad0a-4fd5-ad24-a7f7f4dc0b3f', 'ca9d9719-5528-482c-a6a0-37f507c88200')
---
    private function syncConciergeNotifications(Hotel $hotel, array $prefs): void
    {
        if (! $prefs['concierge_enabled'] || ! ModuleService::isEnabled('concierge')) {
            return;
        }

        $conversations = HotelConciergeConversation::query()
            ->where('hotel_id', $hotel->id)
            ->where('status', '!=', 'archived')
            ->where('unread_staff_count', '>', 0)
            ->orderByDesc('last_message_at')
            ->take(25)
            ->get(['id', 'guest_display_name', 'room_number', 'unread_staff_count']);

        if ($conversations->isEmpty()) {
            return;
        }

        $existing = HotelAdminNotification::query()
            ->where('hotel_id', $hotel->id)
            ->where('source', 'concierge')
            ->whereIn('source_id', $conversations->pluck('id'))
            ->get()
            ->keyBy('source_id');

        foreach ($conversations as $conv) {
            $count = (int) $conv->unread_staff_count;
            $title = 'Nová zpráva · '.$conv->guest_display_name;
            $body = 'Pokoj '.$conv->room_number.' · '.$count.' nepřečten'.($count === 1 ? 'á' : 'ých');
            $row = $existing->get($conv->id);

select * from "hotel_admin_notifications" where "hotel_id" = 'd5f11bcf-7a0d-42ac-a04b-44d0add733d6' and "source" = 'concierge' and "source_id" in ('c1350ffe-c001-4025-b982-00d20799391a', '8eaaae49-4348-433f-9c1b-4df99a10d0a5', '181d9c3f-6d72-4a07-b446-57119790889c')
---
                ->whereNotIn('source_id', $activeIds)
                ->delete();
        } else {
            HotelAdminNotification::query()
                ->where('hotel_id', $hotel->id)
                ->where('source', 'concierge')
                ->delete();