app/Services/ReceptionService.php

    public function board(Hotel $hotel, ?int $floor = null, ?string $occupancy = null, ?string $cleaning = null): array
    {
        $this->syncCrmGuestsIntoReception($hotel);

        $roomsQuery = HotelRoom::query()
            ->where('hotel_id', $hotel->id)
            ->orderByDesc('floor')
            ->orderBy('sort_order')
            ->orderBy('room_number');

        if ($floor !== null) {
            $roomsQuery->where('floor', $floor);
        }
        if ($occupancy) {
            $roomsQuery->where('occupancy_status', $occupancy);
        }
        if ($cleaning) {
            $roomsQuery->where('cleaning_status', $cleaning);
        }

        $rooms = $roomsQuery->get();
---
select * from "hotel_rooms" where "hotel_id" = 'd5f11bcf-7a0d-42ac-a04b-44d0add733d6' order by "floor" desc, "sort_order" asc, "room_number" asc

            ->get()
            ->keyBy('room_id');

        $balances = HotelFolioLine::query()
            ->where('hotel_id', $hotel->id)
            ->whereIn('stay_id', $activeStays->pluck('id')->all())
            ->selectRaw('stay_id, coalesce(sum(amount), 0) as total, max(currency) as currency')
            ->groupBy('stay_id')
            ->get()
            ->keyBy('stay_id');

        $openIssueRoomIds = DB::connection(config('otelapps.db_connection'))
            ->table('hotel_room_issues')
            ->where('hotel_id', $hotel->id)
            ->where('status', 'open')
            ->whereIn('room_id', $roomIds)
            ->pluck('room_id')
            ->unique()
            ->all();
---
select stay_id, coalesce(sum(amount), 0) as total, max(currency) as currency from "hotel_folio_lines" where "hotel_id" = 'd5f11bcf-7a0d-42ac-a04b-44d0add733d6' and "stay_id" in ('51fcc894-0d22-41a7-a051-0719bc410f6b', '68773be1-e7d6-42ea-a55a-0772d612feba', 'b03c37c0-a254-4c83-818a-8f8152adeff9', '12590025-53ff-46b9-ae6d-5fc4e4d827ed', '37e3c147-43fb-4de9-8d08-0d788e5bcd52', '6838c8ac-91c1-4967-8b70-18cd5561d2b7', '3f14f43d-ad8a-4ca2-b956-765599c36928', '98b2b99b-464c-4d07-9c2e-5e7b669822f9', '44dcd62e-f8ac-4e1e-9843-fb866d9110e1', 'f54be871-2dbd-4144-9ca8-3a51998a3c07', 'ab215b87-d157-49fa-9357-a60f8251dc58', '23b8d4ac-d1d9-49b2-a7d2-c9edb2e6f8d2', '5e0b0166-6a46-4c51-9ad5-dd72656492c7', '693ee045-8356-4a42-8763-267ee26fb0c6', 'ba2f23e4-84af-4912-9def-f8dac7ba24f3', '64a41aca-6301-45c7-bdc4-c301ce6bc196', '2ef4c6ca-9c6c-4c94-a8d3-e00e4241b926', 'f26fa014-a958-4eb2-8f16-7ce3bc9caa4c', 'd783eb63-89b7-489c-99a1-1bde0eb60428') group by "stay_id"
select "room_id" from "hotel_room_issues" where "hotel_id" = 'd5f11bcf-7a0d-42ac-a04b-44d0add733d6' and "status" = 'open' and "room_id" in ('2a5b08c0-716e-4bcc-9b3e-7cfe539123f6', '2d8cad3c-9f52-4da7-b779-d2fa9b0d6378', '585a6b17-23f6-4521-bb75-61998de4a18b', '5cc0f831-8349-4d45-83ff-daf1a01f3403', '0d9b8c76-2535-4c37-8944-a3ea03200e7f', '7e066672-0c90-44a7-a1d9-fdc74d84bc36', 'd7ebfc1a-bcd4-4268-868c-4012e2aee965', '7b38a297-300d-44d2-9670-b58efece2782', '7652edb4-08e9-4589-831a-1db7aaa74dab', 'b204f78f-cccc-410c-92ea-aea0e8d60501', '2d3f8bbb-e7a5-406e-ab5b-5a070d2c3822', '2405e319-ecab-4f14-8757-616e0f722f5a', 'df72329a-027a-4fe1-99da-9b3477381ebb', 'f9719ffa-2516-4b75-ab8a-2444a3cb5f3e', '73205739-2e14-4d46-9799-97a197f6ab46', 'b566f050-82e4-4f26-9e48-120c5ac5fd16', '0c9027d7-b9f4-4452-b818-4aa7d32e9612', '21694698-50c1-4b20-ac69-a207c9cce807', 'c5328a5d-9db4-477c-a7e9-713ec6d9706d', '0f667922-0473-4a3c-88d3-785d8d7d32de')

    private function syncCrmGuestsIntoReception(Hotel $hotel): void
    {
        $profiles = HotelCrmGuestProfile::query()
            ->where('hotel_id', $hotel->id)
            ->whereNotNull('room_number')
            ->where('room_number', '!=', '')
            ->get();
---
select * from "hotel_crm_guest_profiles" where "hotel_id" = 'd5f11bcf-7a0d-42ac-a04b-44d0add733d6' and "room_number" is not null and "room_number" != ''

            $floor = $this->inferFloor($roomNumber);
            $sortOrder = (int) (preg_replace('/\D+/', '', $roomNumber) ?: 0);

            $room = HotelRoom::query()->firstOrCreate(
                [
                    'hotel_id' => $hotel->id,
                    'room_number' => $roomNumber,
                ],
                [
                    'floor' => $floor,
                    'occupancy_status' => 'occupied',
                    'cleaning_status' => 'clean',
                    'cleaning_note' => null,
                    'sort_order' => $sortOrder,
                ],
            );
---
select * from "hotel_rooms" where ("hotel_id" = 'd5f11bcf-7a0d-42ac-a04b-44d0add733d6' and "room_number" = '315') limit 1

                $room->save();
            }

            $stay = HotelStay::query()
                ->where('hotel_id', $hotel->id)
                ->where('room_id', $room->id)
                ->where('status', 'active')
                ->first();
---
select * from "hotel_stays" where "hotel_id" = 'd5f11bcf-7a0d-42ac-a04b-44d0add733d6' and "room_id" = '2d8cad3c-9f52-4da7-b779-d2fa9b0d6378' and "status" = 'active' limit 1

                ]);
            }

            $primaryGuest = HotelStayGuest::query()
                ->where('stay_id', $stay->id)
                ->where('is_primary', true)
                ->first();
---
select * from "hotel_stay_guests" where "stay_id" = '64a41aca-6301-45c7-bdc4-c301ce6bc196' and "is_primary" = 'true' limit 1