app/Services/TicketService.php

    public function show(Hotel $hotel, User $user, string $id): array
    {
        $ticket = $this->findVisibleOrFail($hotel, $user, $id);
        $ticket->load(['ticketEvents' => fn ($q) => $q->orderBy('created_at')]);

        $assignee = null;
        if ($ticket->assigned_user_id) {
            $assignee = User::query()->with('userType')->find($ticket->assigned_user_id);
        }

        return [
            'ticket' => $this->detailItem($ticket, $assignee),
            'events' => $ticket->ticketEvents->map(fn (HotelTicketEvent $e) => [
                'id' => $e->id,
                'event_type' => $e->event_type,
                'body' => $e->body,
                'actor_label' => $e->actor_label,
                'created_at' => optional($e->created_at)?->toIso8601String(),
                'metadata' => $e->metadata ?? [],
            ])->values()->all(),
            'room' => $this->roomContext($hotel, $ticket->room_number),
            'permissions' => [
                'claim' => $user->hasPermission('tickets.claim'),
                'complete' => $user->hasPermission('tickets.close'),
                'reassign' => $user->hasPermission('tickets.reassign'),
                'edit' => $user->hasPermission('tickets.edit'),
                'create' => $user->hasPermission('tickets.create'),
            ],
        ];
---
select * from "user_types" where "user_types"."id" in (1)
select * from "users" where "users"."id" = 1 limit 1

    private function visibleQuery(Hotel $hotel, User $user)
    {
        $query = HotelServiceRequest::query()
            ->where('hotel_id', $hotel->id)
            ->whereNotIn('status', ['archived']);

        if ($user->hasPermission('tickets.view_all') || $user->isSuperAdmin()) {
            return $query;
        }

        $queues = $user->allowedQueueKeys();
        $query->where(function ($q) use ($queues, $user) {
            if ($queues !== []) {
                $q->whereIn('queue_key', $queues);
            } else {
                $q->whereRaw('1 = 0');
            }
            $q->orWhere('assigned_user_id', $user->id);
        });
---
select * from "hotel_service_requests" where "hotel_id" = 'd5f11bcf-7a0d-42ac-a04b-44d0add733d6' and "status" not in ('archived') and ("queue_key" in ('room_delivery') or "assigned_user_id" = 4) and "id" = '474d41ed-82b5-4f13-9c01-09969455aab5' limit 1

    private function addEvent(
        HotelServiceRequest $ticket,
        string $type,
        string $body,
        ?User $actor = null,
        array $metadata = [],
    ): void {
        HotelTicketEvent::query()->create([
            'request_id' => $ticket->id,
            'event_type' => $type,
            'body' => $body,
            'actor_user_id' => $actor?->id,
            'actor_label' => $actor?->name ?? 'system',
            'metadata' => $metadata,
            'created_at' => now(),
        ]);
---
insert into "hotel_ticket_events" ("request_id", "event_type", "body", "actor_user_id", "actor_label", "metadata", "created_at", "id") values ('80073729-91e0-4061-906d-f6b4317f3b11', 'completed', 'Úkol dokončen', 1, 'Super Admin', '{}', '2026-08-25 02:32:43', '188f5169-e4d4-4c89-9798-486d472afc92')

    private function queuesForHotel(Hotel $hotel): array
    {
        return HotelTicketQueue::query()
            ->where('hotel_id', $hotel->id)
            ->where('is_active', true)
            ->orderBy('sort_order')
            ->get()
            ->map(fn (HotelTicketQueue $q) => [
                'key' => $q->key,
                'label' => $q->label,
                'color' => $q->color,
            ])
            ->values()
            ->all();
---
select * from "hotel_ticket_queues" where "hotel_id" = 'd5f11bcf-7a0d-42ac-a04b-44d0add733d6' and "is_active" = 'true' order by "sort_order" asc

    private function roomContext(Hotel $hotel, string $roomNumber): ?array
    {
        try {
            $room = HotelRoom::query()
                ->where('hotel_id', $hotel->id)
                ->where('room_number', $roomNumber)
                ->with('roomType')
                ->first();
---
select * from "hotel_rooms" where "hotel_id" = 'd5f11bcf-7a0d-42ac-a04b-44d0add733d6' and "room_number" = '101' limit 1