app/Services/TicketService.php

    private function visibleQuery(Hotel $hotel, User $user)
    {
        $query = HotelServiceRequest::query()
            ->where('hotel_id', $hotel->id)
            ->whereNotIn('status', ['archived']);

        if ($user->hasPermission('tickets.view_all') || $user->isSuperAdmin()) {
            return $query;
        }

        $queues = $user->allowedQueueKeys();
        $query->where(function ($q) use ($queues, $user) {
            if ($queues !== []) {
                $q->whereIn('queue_key', $queues);
            } else {
                $q->whereRaw('1 = 0');
            }
            $q->orWhere('assigned_user_id', $user->id);
        });
---
select * from "hotel_service_requests" where "hotel_id" = 'd5f11bcf-7a0d-42ac-a04b-44d0add733d6' and "status" not in ('archived') and "id" = '6b40fe4e-818d-4425-9ea9-f8dbf6be866f' limit 1

    private function queuesForHotel(Hotel $hotel): array
    {
        return HotelTicketQueue::query()
            ->where('hotel_id', $hotel->id)
            ->where('is_active', true)
            ->orderBy('sort_order')
            ->get()
            ->map(fn (HotelTicketQueue $q) => [
                'key' => $q->key,
                'label' => $q->label,
                'color' => $q->color,
            ])
            ->values()
            ->all();
---
select * from "hotel_ticket_queues" where "hotel_id" = 'd5f11bcf-7a0d-42ac-a04b-44d0add733d6' and "is_active" = 'true' order by "sort_order" asc

    private function serviceTypesForHotel(Hotel $hotel, array $queueLabels): array
    {
        return HotelServiceRequestType::query()
            ->where('hotel_id', $hotel->id)
            ->where('is_active', true)
            ->orderBy('sort_order')
            ->orderBy('label')
            ->get()
            ->map(function (HotelServiceRequestType $type) use ($hotel, $queueLabels) {
                $queueKey = is_string($type->queue_key) && trim($type->queue_key) !== ''
                    ? trim($type->queue_key)
                    : PermissionCatalog::queueForServiceModule($type->module_key, $hotel->id);

                return [
                    'module_key' => $type->module_key,
                    'label' => $this->labelForModule($type->module_key, $type->label),
                    'icon_name' => $type->icon_name,
                    'queue_key' => $queueKey,
                    'queue_label' => $queueLabels[$queueKey] ?? $queueKey,
                ];
            })
            ->values()
            ->all();
---
select * from "hotel_service_request_types" where "hotel_id" = 'd5f11bcf-7a0d-42ac-a04b-44d0add733d6' and "is_active" = 'true' order by "sort_order" asc, "label" asc

    private function roomContext(Hotel $hotel, string $roomNumber): ?array
    {
        try {
            $room = HotelRoom::query()
                ->where('hotel_id', $hotel->id)
                ->where('room_number', $roomNumber)
                ->with('roomType')
                ->first();
---
select * from "hotel_rooms" where "hotel_id" = 'd5f11bcf-7a0d-42ac-a04b-44d0add733d6' and "room_number" = '101' limit 1