app/Http/Controllers/Api/ActivityRevenueController.php

select * from "hotel_service_requests" where "hotel_id" = 'd5f11bcf-7a0d-42ac-a04b-44d0add733d6' and "created_at" >= '2026-08-24 00:00:00' and "status" not in ('rejected', 'archived') order by "created_at" desc
---
    public function summary(Request $request): JsonResponse
    {
        if (! ModuleService::isEnabled('activity')) {
            return response()->json([
                'message' => 'Modul Activity není zapnutý.',
                'activity_enabled' => false,
            ], 403);
        }

        $period = $request->query('period', 'today');
        if (! in_array($period, ['today', 'week', 'month'], true)) {
            $period = 'today';
        }

        $hotel = $this->resolveHotel($request);

        $tz = config('app.timezone', 'Europe/Prague');
        $now = \Carbon\Carbon::now($tz);
        $from = match ($period) {
            'week' => $now->copy()->startOfWeek(),
            'month' => $now->copy()->startOfMonth(),
            default => $now->copy()->startOfDay(),
        };

        $requests = HotelServiceRequest::query()
            ->where('hotel_id', $hotel->id)
            ->where('created_at', '>=', $from)
            ->whereNotIn('status', ['rejected', 'archived'])
            ->orderByDesc('created_at')
            ->get();