app/Http/Controllers/Api/AuthController.php

    public function profiles(): JsonResponse
    {
        if (! config('otelapps.demo_user_switcher')) {
            return response()->json(['message' => 'Přepínač profilů není zapnutý.'], 403);
        }

        $profiles = User::query()
            ->with('userType')
            ->where('is_active', true)
            ->orderBy('id')
            ->get()
            ->map(fn (User $u) => [
                'id' => $u->id,
                'name' => $u->name,
                'email' => $u->email,
                'initials' => $u->initials ?: $u->makeInitials(),
                'job_title' => $u->job_title,
                'user_type' => $u->userType ? [
                    'slug' => $u->userType->slug,
                    'name' => $u->userType->name,
                    'badge_label' => $u->userType->badge_label,
                    'color' => $u->userType->color,
                ] : null,
            ]);
---
select * from "user_types" where "user_types"."id" in (1, 2, 3, 4, 5)
select * from "users" where "is_active" = 1 order by "id" asc