app/Http/Controllers/Api/ConciergeChatController.php

    public function markRead(string $id): JsonResponse
    {
        $conversation = $this->findConversation($id);

        HotelConciergeMessage::query()
            ->where('conversation_id', $conversation->id)
            ->where('sender_type', 'guest')
            ->whereNull('read_by_staff_at')
            ->update(['read_by_staff_at' => now()]);

        $conversation->update(['unread_staff_count' => 0]);

        // Jednorázově při otevření chatu — background proces, neblokuje artisan serve.
        if (ConciergeBotService::needsStaffAttention($this->botService->conversationMode($conversation))
            && ($conversation->guest_locale ?: 'cs') !== 'cs') {
            $needsGuestCs = HotelConciergeMessage::query()
                ->where('conversation_id', $conversation->id)
                ->where('sender_type', 'guest')
                ->where(function ($q) {
                    $q->whereNull('body_translated')
                        ->orWhere('body_translated', '');
                })
                ->exists();
---
select * from "hotel_concierge_messages" where "hotel_concierge_messages"."conversation_id" in ('f69cb65e-5fd4-407d-b4a1-729ebeeb725c') order by "created_at" asc

    private function findConversation(string $id): HotelConciergeConversation
    {
        return HotelConciergeConversation::where('id', $id)->firstOrFail();
---
select * from "hotel_concierge_conversations" where "id" = 'f69cb65e-5fd4-407d-b4a1-729ebeeb725c' limit 1