app/Http/Controllers/Api/ConciergeChatController.php

            ->orderByDesc('updated_at')
            ->get();

        $unreadTotal = HotelConciergeConversation::query()
            ->where('hotel_id', $hotel->id)
            ->where('status', '!=', 'archived')
            ->where(function ($q) {
                $q->where('metadata->mode', ConciergeBotService::MODE_STAFF)
                    ->orWhere('metadata->mode', ConciergeBotService::MODE_WAITING);
            })
            ->sum('unread_staff_count');
---
select sum("unread_staff_count") as aggregate from "hotel_concierge_conversations" where "hotel_id" = 'd5f11bcf-7a0d-42ac-a04b-44d0add733d6' and "status" != 'archived' and ("metadata"->>'mode' = 'staff' or "metadata"->>'mode' = 'waiting')

    public function markRead(string $id): JsonResponse
    {
        $conversation = $this->findConversation($id);

        HotelConciergeMessage::query()
            ->where('conversation_id', $conversation->id)
            ->where('sender_type', 'guest')
            ->whereNull('read_by_staff_at')
            ->update(['read_by_staff_at' => now()]);

        $conversation->update(['unread_staff_count' => 0]);

        // Jednorázově při otevření chatu — background proces, neblokuje artisan serve.
        if (ConciergeBotService::needsStaffAttention($this->botService->conversationMode($conversation))
            && ($conversation->guest_locale ?: 'cs') !== 'cs') {
            $needsGuestCs = HotelConciergeMessage::query()
                ->where('conversation_id', $conversation->id)
                ->where('sender_type', 'guest')
                ->where(function ($q) {
                    $q->whereNull('body_translated')
                        ->orWhere('body_translated', '');
                })
                ->exists();
---
update "hotel_concierge_messages" set "read_by_staff_at" = '2026-08-25 02:53:38' where "conversation_id" = '181d9c3f-6d72-4a07-b446-57119790889c' and "sender_type" = 'guest' and "read_by_staff_at" is null
select exists(select * from "hotel_concierge_messages" where "conversation_id" = 'f69cb65e-5fd4-407d-b4a1-729ebeeb725c' and "sender_type" = 'guest' and ("body_translated" is null or "body_translated" = '')) as "exists"
select * from "hotel_concierge_messages" where "hotel_concierge_messages"."conversation_id" in ('181d9c3f-6d72-4a07-b446-57119790889c') order by "created_at" asc

    private function findConversation(string $id): HotelConciergeConversation
    {
        return HotelConciergeConversation::where('id', $id)->firstOrFail();
---
select * from "hotel_concierge_conversations" where "id" = '181d9c3f-6d72-4a07-b446-57119790889c' limit 1