app/Http/Controllers/Api/ConciergeBotController.php

select exists(select * from "hotel_concierge_messages" where "conversation_id" = 'f69cb65e-5fd4-407d-b4a1-729ebeeb725c' and "sender_type" = 'guest' and ("body_translated" is null or "body_translated" = '')) as "exists"
---
    public function ensureReply(Request $request): JsonResponse
    {
        $data = $request->validate([
            'conversation_id' => ['required', 'uuid'],
            'guest_external_id' => ['required', 'string', 'max:191'],
        ]);

        $conversation = HotelConciergeConversation::query()
            ->where('id', $data['conversation_id'])
            ->where('guest_external_id', $data['guest_external_id'])
            ->first();

        if (! $conversation) {
            return response()->json(['message' => 'Konverzace nenalezena.'], 404);
        }

        if ($denied = $this->deniedIfModuleDisabled($this->slugFromConversation($conversation))) {
            return $denied;
        }

        if ($denied = $this->deniedIfBanned($conversation)) {
            return $denied;
        }

        $mode = $this->botService->conversationMode($conversation);
        $needsWork = false;
        $needsStaffTranslation = false;
        $guestLocale = $conversation->guest_locale ?: 'cs';

        if ($guestLocale !== 'cs') {
            $needsStaffTranslation = HotelConciergeMessage::query()
                ->where('conversation_id', $conversation->id)
                ->whereIn('sender_type', ['staff', 'bot'])
                ->where(function ($q) {
                    $q->whereNull('body_translated')
                        ->orWhere('body_translated', '');
                })
                ->exists();