app/Http/Controllers/Api/ConciergeBotController.php

    public function onGuestMessage(Request $request): JsonResponse
    {
        $data = $request->validate([
            'conversation_id' => ['required', 'uuid'],
            'guest_external_id' => ['required', 'string', 'max:191'],
            'message_id' => ['required', 'uuid'],
        ]);

        $conversation = HotelConciergeConversation::query()
            ->where('id', $data['conversation_id'])
            ->where('guest_external_id', $data['guest_external_id'])
            ->first();

        if (! $conversation) {
            return response()->json(['message' => 'Konverzace nenalezena.'], 404);
        }

        $message = HotelConciergeMessage::query()
            ->where('id', $data['message_id'])
            ->where('conversation_id', $conversation->id)
            ->where('sender_type', 'guest')
            ->first();
---
select * from "hotel_concierge_conversations" where "id" = '055093fc-ceb3-4fb4-aa2b-d3ac42a827db' and "guest_external_id" = 'demo-a1001-vetiška' limit 1
select * from "hotel_concierge_messages" where "id" = '71b677ce-84e9-4b54-8504-668a1583e2a7' and "conversation_id" = '055093fc-ceb3-4fb4-aa2b-d3ac42a827db' and "sender_type" = 'guest' limit 1

    public function escalate(Request $request): JsonResponse
    {
        $data = $request->validate([
            'conversation_id' => ['required', 'uuid'],
            'guest_external_id' => ['required', 'string', 'max:191'],
        ]);

        $conversation = HotelConciergeConversation::query()
            ->where('id', $data['conversation_id'])
            ->where('guest_external_id', $data['guest_external_id'])
            ->first();
---
select * from "hotel_concierge_conversations" where "id" = '055093fc-ceb3-4fb4-aa2b-d3ac42a827db' and "guest_external_id" = 'demo-a1001-vetiška' limit 1

    public function presence(Request $request): JsonResponse
    {
        $data = $request->validate([
            'conversation_id' => ['required', 'uuid'],
            'guest_external_id' => ['required', 'string', 'max:191'],
            'status' => ['required', Rule::in([
                ConciergePresenceService::STATUS_IN_CHAT,
                ConciergePresenceService::STATUS_BUSY,
                ConciergePresenceService::STATUS_TYPING,
            ])],
        ]);

        $conversation = HotelConciergeConversation::query()
            ->where('id', $data['conversation_id'])
            ->where('guest_external_id', $data['guest_external_id'])
            ->first();
---
select * from "hotel_concierge_conversations" where "id" = '055093fc-ceb3-4fb4-aa2b-d3ac42a827db' and "guest_external_id" = 'demo-a1001-vetiška' limit 1

    public function satisfaction(Request $request): JsonResponse
    {
        $data = $request->validate([
            'conversation_id' => ['required', 'uuid'],
            'guest_external_id' => ['required', 'string', 'max:191'],
            'message_id' => ['required', 'uuid'],
            'answer' => ['required', 'in:yes,no'],
        ]);

        $conversation = HotelConciergeConversation::query()
            ->where('id', $data['conversation_id'])
            ->where('guest_external_id', $data['guest_external_id'])
            ->first();
---
select * from "hotel_concierge_conversations" where "id" = '181d9c3f-6d72-4a07-b446-57119790889c' and "guest_external_id" = 'demo-b2002-kratky' limit 1

    public function ensureReply(Request $request): JsonResponse
    {
        $data = $request->validate([
            'conversation_id' => ['required', 'uuid'],
            'guest_external_id' => ['required', 'string', 'max:191'],
        ]);

        $conversation = HotelConciergeConversation::query()
            ->where('id', $data['conversation_id'])
            ->where('guest_external_id', $data['guest_external_id'])
            ->first();
---
select * from "hotel_concierge_conversations" where "id" = '055093fc-ceb3-4fb4-aa2b-d3ac42a827db' and "guest_external_id" = 'demo-a1001-vetiška' limit 1