app/Http/Controllers/Api/HotelServiceRequestController.php

            $requests = $query->orderByDesc('created_at')->get();
        }

        $statusCounts = HotelServiceRequest::query()
            ->where('hotel_id', $hotel->id)
            ->selectRaw('status, count(*) as aggregate')
            ->groupBy('status')
            ->pluck('aggregate', 'status');

        $serviceTypes = HotelServiceRequestType::query()
            ->where('hotel_id', $hotel->id)
            ->where('is_active', true)
            ->orderBy('sort_order')
            ->orderBy('label')
            ->get();
---
select status, count(*) as aggregate from "hotel_service_requests" where "hotel_id" = 'd5f11bcf-7a0d-42ac-a04b-44d0add733d6' group by "status"
select * from "hotel_service_request_types" where "hotel_id" = 'd5f11bcf-7a0d-42ac-a04b-44d0add733d6' and "is_active" = 'true' order by "sort_order" asc, "label" asc