app/Models/User.php

select * from "user_types" where "user_types"."id" = 1 limit 1
select "permissions".*, "user_type_permission"."user_type_id" as "pivot_user_type_id", "user_type_permission"."permission_id" as "pivot_permission_id" from "permissions" inner join "user_type_permission" on "permissions"."id" = "user_type_permission"."permission_id" where "user_type_permission"."user_type_id" in (4)
---
    public function permissionKeys(): array
    {
        if ($this->isSuperAdmin()) {
            return ['*'];
        }

        if (! $this->relationLoaded('userType')) {
            $this->load('userType.permissions');
        } elseif ($this->userType && ! $this->userType->relationLoaded('permissions')) {
            $this->userType->load('permissions');