app/Jobs/ProcessConciergeGuestMessage.php

select "id" from "hotel_concierge_messages" where "conversation_id" = '969a9cc8-e870-4c7a-82a1-c2b765ec13de' and "sender_type" = 'guest' order by "created_at" desc, "id" desc limit 1
---
    public static function spawnBackground(string $conversationId, ?string $messageId = null): bool
    {
        if (! function_exists('exec')) {
            return false;
        }

        // Sjednoť dedupe: on-message (messageId) i ensure-reply (null) musí sdílet klíč.
        if ($messageId === null || $messageId === '') {
            $lastGuest = HotelConciergeMessage::query()
                ->where('conversation_id', $conversationId)
                ->where('sender_type', 'guest')
                ->orderByDesc('created_at')
                ->orderByDesc('id')
                ->value('id');